In [9]:
# This file is created to practise of pandas famework

In [10]:
import pandas as pd 
import numpy as np

In [11]:
# Makinf a dataframe of 2d with list 
list1 = [['abc',1],['def',2],['ghi',3]]
df = pd.DataFrame(list1)
display(df)

     0  1
0  abc  1
1  def  2
2  ghi  3

In [12]:
# adding column name
column = ['Alphabet', 'Number']
df = pd.DataFrame(list1, columns=column)
display(df)

  Alphabet  Number
0      abc       1
1      def       2
2      ghi       3

In [13]:
# Using pd.Dataframe.from_records()
# This method is ideal for working with the sequence of records like list, tuples, dict or objects 
# It treats each item like a row of data
# When to use ?? Use when your data is sstructed like records
# Often from  JSON , CSV or database fetches 

records = [('John', 19), ('Joe', 21)]
df =  pd.DataFrame.from_records(records, columns=['Name', 'Age'])
display(df)

   Name  Age
0  John   19
1   Joe   21

In [14]:
# pd.DataFrame.from_dict()
# When to use ?? Use it when you have dictionary based data 
# If orient = 'index' the keys are treated as row indices

data = {
    'name': ['a','b','c'],
    'age': [18,19,20],
    'div':['x','y','z']
}

df =  pd.DataFrame.from_dict(data, orient='index')
display(df)
df =  pd.DataFrame.from_dict(data)
df

       0   1   2
name   a   b   c
age   18  19  20
div    x   y   z

  name  age div
0    a   18   x
1    b   19   y
2    c   20   z

No matter how we are creating the datatypes we can specify them using dtype arguement or by assiging the types after creation

In [16]:
try:
    df = pd.DataFrame(data, dtype='float' )
except Exception as e :
    print("The error is :",e)
else:
    display(df)
# In this dataframe the column include the str so it will generate the error 
# instead of this we can use 
ddf = pd.DataFrame(data)
ddf = ddf.astype({'age':'float'})
display(ddf)

The error is : could not convert string to float: 'a'

  name   age div
0    a  18.0   x
1    b  19.0   y
2    c  20.0   z

In [19]:
# adding new column in the data Frame 
ddf['N_col'] = ['Tiger','Lion','Elephant']
ddf['N_Int'] = [11,12,122]
ddf

  name   age div     N_col  N_Int
0    a  18.0   x     Tiger     11
1    b  19.0   y      Lion     12
2    c  20.0   z  Elephant    122

In [24]:
ddf = ddf.astype({
    'age' :'float',
    'N_Int':'complex',
    'div':'bool'
})
display(ddf)

  name   age   div     N_col         N_Int
0    a  18.0  True     Tiger   11.0+  0.0j
1    b  19.0  True      Lion   12.0+  0.0j
2    c  20.0  True  Elephant  122.0+  0.0j

In [26]:
ddf = ddf.transpose()
ddf

  name   age   div     N_col     N_Int
0    a  18.0  True     Tiger   (11+0j)
1    b  19.0  True      Lion   (12+0j)
2    c  20.0  True  Elephant  (122+0j)

In [28]:
data = [['Geek1', 28, 'Engineer'],
        ['Geek2', None, 'Data Scientist'],
        ['Geek3', 32, None]]

columns =  ['Name', 'Age','Designation']

df = pd.DataFrame(data , columns=columns)
print(df)

    Name   Age     Designation
0  Geek1  28.0        Engineer
1  Geek2   NaN  Data Scientist
2  Geek3  32.0            None

In [29]:
df = df.replace({'None':np.nan})
df

    Name   Age     Designation
0  Geek1  28.0        Engineer
1  Geek2   NaN  Data Scientist
2  Geek3  32.0            None

In [36]:
data = [['Geek1', 28, 'Engineer'],
        ['Geek2', 25, 'Data Scientist'],
        ['Geek3', '32', 'Manager']]
# here the age is declared as string 
# to_string only can be done when there is only digit in the str 

df = pd.DataFrame(data, columns=columns)


display(df)
# print(df['Age'].dtype)
df['Age'] = pd.to_numeric(df.Age, errors='coerce', downcast='integer')
print(df)

    Name Age     Designation
0  Geek1  28        Engineer
1  Geek2  25  Data Scientist
2  Geek3  32         Manager

    Name  Age     Designation
0  Geek1   28        Engineer
1  Geek2   25  Data Scientist
2  Geek3   32         Manager

In [37]:
data = [('ANSH', 22, 9),
        ('SAHIL', 22, 6),
        ('JAYAN', 23, 8),
        ('AYUSHI', 21, 7),
        ('SPARSH', 20, 8) ]
df = pd.DataFrame.from_records(data, columns=['name', 'age', 'score'])
df

     name  age  score
0    ANSH   22      9
1   SAHIL   22      6
2   JAYAN   23      8
3  AYUSHI   21      7
4  SPARSH   20      8

In [38]:
df.columns =  df.columns.str.capitalize()
df

     Name  Age  Score
0    ANSH   22      9
1   SAHIL   22      6
2   JAYAN   23      8
3  AYUSHI   21      7
4  SPARSH   20      8

In [39]:
df = df.transpose()

In [40]:
df

          0      1      2       3       4
Name   ANSH  SAHIL  JAYAN  AYUSHI  SPARSH
Age      22     22     23      21      20
Score     9      6      8       7       8

In [53]:
df = df.transpose()
df.index = df.index.astype(str).str.upper()
df

          0      1      2       3       4
NAME   ANSH  SAHIL  JAYAN  AYUSHI  SPARSH
AGE      22     22     23      21      20
SCORE     9      6      8       7       8

In [54]:
df = df.transpose()
df

     NAME AGE SCORE
0    ANSH  22     9
1   SAHIL  22     6
2   JAYAN  23     8
3  AYUSHI  21     7
4  SPARSH  20     8

### Transform vs Apply()

In [57]:
# transfrom return shape matches original 
# works element wise : each group returns something the sam e size as the input
# Ideal when you want to add new column to the dataframe 
# Output shape is always aligned with the original index
 
df['score_mean'] = df.groupby('AGE')['SCORE'].transform('mean')
df

     NAME AGE SCORE score_mean
0    ANSH  22     9        7.5
1   SAHIL  22     6        7.5
2   JAYAN  23     8        8.0
3  AYUSHI  21     7        7.0
4  SPARSH  20     8        8.0

In [58]:
# apply() - Flexible , but shape may change 
# Can return aggregated results, series or even dataframe 

print(df.groupby('AGE')['SCORE'].apply(lambda x: x.mean()))

AGE
20    8.0
21    7.0
22    7.5
23    8.0
Name: SCORE, dtype: float64

In [ ]:
df['score_mean_apply']= df.groupby('AGE')['SCORE'].apply(lambda x: x.mean())
df
# This will give the missing values because there is 4 output and we need 5 answer to fill the column

     NAME AGE SCORE score_mean  score_mean_apply
0    ANSH  22     9        7.5               NaN
1   SAHIL  22     6        7.5               NaN
2   JAYAN  23     8        8.0               NaN
3  AYUSHI  21     7        7.0               NaN
4  SPARSH  20     8        8.0               NaN

### Pivot vs Pivot_Table()

Pivoting is a powerful technique to reshape detailed (long - form) data into a summary table (wide-form ) --ideal for spotting trends and comparing group statistics.

pivot() --  Strict but Simple

* Best used when your data is perfectly clean, meaning there is one unique value for every combination of index and columns.

* Converts rows into columns for easier comparison.

* It is fast and straightforward, but throws an error if duplicate entries exist.

In [61]:
data = [('ANSH', 22, 9),
        ('SAHIL', 22, 6),
        ('JAYAN', 23, 8),
        ('AYUSHI', 21, 7),
        ('SPARSH', 20, 8) ]

df = pd.DataFrame(data , columns=['Name','Age','Score'])
df_p = df.pivot(index='Name', columns='Score', values='Age')
print(df_p)

Score      6     7     8     9
Name
ANSH     NaN   NaN   NaN  22.0
AYUSHI   NaN  21.0   NaN   NaN
JAYAN    NaN   NaN  23.0   NaN
SAHIL   22.0   NaN   NaN   NaN
SPARSH   NaN   NaN  20.0   NaN

In [66]:
df_pivot = pd.DataFrame({
    'Department': ['HR', 'HR', 'Sales', 'Sales', 'IT'],
    'Gender': ['M', 'F', 'M', 'F', 'M'],
    'Salary': [3000, 3200, 4000, 3900, 4500]
})

try:
    pivot = pd.pivot(df, index="Department", columns="Gender", values="Salary")

except Exception as e:
    print(e)

else:
    print(pivot)

'Department'

pivot_table()  Flexible and Powerful

* Works just like pivot(), but with aggregation support  great for handling duplicates or missing data.

* Lets you group data by one or more keys.

* Supports common aggregations like mean, sum, count, and even multiple functions.

* Accepts multiple columns in index, columns, and values.

In [67]:
pivot_t = df_pivot.pivot_table(index='Department', columns='Gender', values='Salary', aggfunc='mean')
pivot

Gender           F       M
Department
HR          3200.0  3000.0
IT             NaN  4500.0
Sales       3900.0  4000.0